chat_system_598715820_actor_description=Elerio Shivarius. Archivist of the magic school.
chat_system_598715820_snap_0_question=^?^So how goes your search? Have you found those rare specimens which are so essential to our research?
chat_system_598715820_snap_0_answer_0=^?^I've found ten Royal Snakes for you.
chat_system_598715820_snap_0_answer_1=^?^I found thirty Dragonflies, it wasn't hard.
chat_system_598715820_snap_0_answer_2=^?^I've managed to find a Cyclops. And believe me - it wasn't easy!
chat_system_598715820_snap_0_answer_3=^?^By the way, can you remind me where I can find these animals?
chat_system_598715820_s_question=^?^Fine, give them to me. Here are 1000 gold coins, as I promised. It must have been hard with the snakes, eh?<br>By the way, our main animal specialist, master Ferran, claims that unlike common snakes, royal snakes are intelligent enough to understand human speech! Of course, I don't believe him, but let's not let him get wind of that, eh?
chat_system_598715820_s_answer_0=^?^Hmm. The teachers at the temple taught us that snakes couldn't hear at all - they just feel heat and detect movement. Well, thanks for the gold!
chat_system_598715820_snap_3_question=^?^Wait a minute, it's not yet time to thank me, I haven't finished my speech! Ahem. These were the last creatures we needed, so you may now consider your search complete!<br>Thanks to you, we will now be able to commence a study of the influence of magic flows upon an animal body's spontaneous mutation.<br>Excellent job - and a well-earned reward!<br>[reward]
chat_system_598715820_snap_3_answer_0=^?^Oh, thank you! I don't really have a clear understanding of what mutation you're studying, but I do wish you the greatest success. See you later!
chat_system_598715820_switch_0_header_0=^?^You are welcome, and know that I always keep my word. May your further searches always be so successful!
chat_system_598715820_d_question=^?^I don't even want to ask... but how did you manage to catch these nimble creatures? Anyway, here is your 500 gold.<br>By the way, you know that these animals - some call them Dragonflies, others call them Small Dragons, but in fact they are a hybrid of polypterous insect and animal. They are able to exhale either acid or fire. Quite extraordinary really, and it likely means they passed into Endoria from another world!
chat_system_598715820_d_answer_0=^?^Very interesting. Thanks, and I'll be seeing you later.
chat_system_598715820_c_question=^?^That's just great! To tell you the truth, I had some doubt that you'd be able to get the Cyclops. I present you with 4000 gold coins, to reward you for bringing us the creature. It's a lot of money, but it's worth it.<br>Long ago, there were many such creatures, but the mages hunted them down, nearly bringing them to extinction. The stone skin of these creatures can successfully resist fire and cold, acid and poisons, so mages used the Cyclops as subjects of experiments, testing various combat spells upon them. 
chat_system_598715820_c_answer_0=^?^Ah, that's sad about the Cyclops. Anyway, thanks for the money.
chat_system_598715820_snap_1_question=^?^As for the Dragonflies, you can find them on the river farm or ask the peasants if they've caught sight of them. Snakes are sometimes brought to the menagerie, and there're always lots of them in the swamps. It's going to be really hard to get a Cyclops, though. These creatures are not only rare, but also quite dangerous. You might try to look in the Creiston Mines.<br>By the way, I think it would be easier for you to get snakes' and dragonflies' eggs, and to obtain the needed animals from them.
chat_system_598715820_snap_1_answer_0=^?^Ok, I won't forget, but that's not all that I wanted to ask about.
chat_system_598715820_snap_1_header_0=^?^Yes, I'm listening. I still have a few minutes before classes commence. What is it that you want?
chat_system_598715820_snap_1_answer_1=^?^Thank you, I'll commence the search immediately.
